Revit 2024 API
RebarConstraint.GetTargetHostFaceReference Method (Int32)
 Returns a reference that corresponds to the face to which the RebarConstraint is attached specified by the targetIndex. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover.'
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public Reference GetTargetHostFaceReference(
	int targetIndex
)
Visual Basic
Public Function GetTargetHostFaceReference ( _
	targetIndex As Integer _
) As Reference
Visual C++
public:
Reference^ GetTargetHostFaceReference(
	int targetIndex
)
Parameters
targetIndex
Type: System.Int32
 The index of the target. Should be between 0 and NumberOfTargets().
Return Value
 Requested reference.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  targetIndex is out of range.
Autodesk.Revit.Exceptions.InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace' or 'ToCover.'
See Also
RebarConstraint Class
GetTargetHostFaceReference Overload
Autodesk.Revit.DB.Structure Namespace